few changes made
